import SubLayout from '../../components/UI/SubLayout';

export default function About() {
  return (
    <SubLayout className='about_container' subTitle='about'>
      <>
        <article className='about_about'>
          <h3 className='common_h3'>About Me</h3>
          <div className='about_row'>
            <div className='about-text_area'>
              <h1>About.</h1>
              <p className='intro'>
                안녕하세요! 땡땡땡땡땡 프론트엔드 개발자 황수연입니다.
              </p>
              <p className='desc'>
                웹 개발의 매력에 빠져있는 프론트엔드 개발자입니다. 코드를 짜는
                것을 좋아하고, 웹사이트를 개발함으로써 사람들에게 긍정적인
                영향을 줄 수 있다는 것을 믿어요 웹의 세계로 여러분을 초대합니다!
                저는 프론트엔드 개발자로서 사용자들의 요구에 부응하는 멋진 웹
                애플리케이션을 만들기 위해 열심히 노력하고 있어요. 함께 웹을
                즐겁게 만들어볼까요 (임시문구)
              </p>
            </div>
            <div className='about-img_area'></div>
          </div>
          <ul className='about-images'>
            <li></li>
            <li></li>
            <li></li>
            <li></li>
            <li></li>
            <li></li>
          </ul>
        </article>
        <article className='about_education'>
          <h3 className='common_h3'>Education</h3>
          <ul className='education-list'>
            <li>
              <div className='info'>
                <div className='logo'>
                  <svg
                    width='100%'
                    viewBox='0 0 97 14'
                    xmlns='http://www.w3.org/2000/svg'
                    className='zerobase'
                  >
                    <path
                      d='M0 11.3332L4.98685 5.76758H0.160866V3.53098H8.38899V5.4772L3.38503 11.0428H8.39241V13.2794H0V11.3332Z'
                      fill='white'
                    ></path>
                    <path
                      d='M9.38281 8.45529V8.41726C9.38281 5.63447 11.344 3.34256 14.154 3.34256C17.3782 3.34256 18.8534 5.86954 18.8534 8.63504C18.8534 8.85283 18.8363 9.10864 18.8157 9.36099H12.1038C12.3742 10.6158 13.2368 11.2692 14.4621 11.2692C15.3793 11.2692 16.0468 10.9788 16.8032 10.2701L18.3708 11.6702C17.4706 12.7971 16.1734 13.4885 14.4278 13.4885C11.5254 13.4954 9.38281 11.4386 9.38281 8.45529ZM16.1905 7.63946C16.0297 6.4019 15.3075 5.56533 14.1575 5.56533C13.0211 5.56533 12.2852 6.38461 12.0696 7.63946H16.1905Z'
                      fill='white'
                    ></path>
                    <path
                      d='M20.5508 3.52997H23.2889V5.49348C23.8468 4.14876 24.747 3.27417 26.3693 3.34676V6.24017H26.2256C24.4081 6.24017 23.2889 7.34983 23.2889 9.67631V13.2784H20.5508V3.52997Z'
                      fill='white'
                    ></path>
                    <path
                      d='M26.9961 8.45529V8.41726C26.9961 5.61719 29.2277 3.34256 32.2362 3.34256C35.2242 3.34256 37.4421 5.57916 37.4421 8.37923V8.4138C37.4421 11.2139 35.2105 13.4885 32.202 13.4885C29.2106 13.4954 26.9961 11.2588 26.9961 8.45529ZM34.7382 8.45529V8.41726C34.7382 6.9792 33.7114 5.72435 32.1986 5.72435C30.631 5.72435 29.6966 6.94463 29.6966 8.37923V8.4138C29.6966 9.85187 30.7234 11.1067 32.2362 11.1067C33.8038 11.1136 34.7382 9.89335 34.7382 8.45529Z'
                      fill='white'
                    ></path>
                    <path
                      d='M39.1328 6.31458H44.6262V8.96946H39.1328V6.31458Z'
                      fill='white'
                    ></path>
                    <path
                      d='M49.285 12.0023V13.2744H46.5469V0H49.285V4.92951C49.9524 4.02035 50.8697 3.34626 52.2936 3.34626C54.5457 3.34626 56.6883 5.13001 56.6883 8.38293V8.4175C56.6883 11.6739 54.5799 13.4542 52.2936 13.4542C50.8355 13.4576 49.9353 12.787 49.285 12.0023ZM53.9501 8.42096V8.38639C53.9501 6.76857 52.8686 5.69348 51.5919 5.69348C50.3118 5.69348 49.2508 6.76511 49.2508 8.38639V8.42096C49.2508 10.0388 50.3118 11.1139 51.5919 11.1139C52.8686 11.1139 53.9501 10.0561 53.9501 8.42096Z'
                      fill='white'
                    ></path>
                    <path
                      d='M57.582 10.4736V10.4391C57.582 8.30963 59.1838 7.32788 61.4736 7.32788C62.4457 7.32788 63.1473 7.49035 63.8318 7.72887V7.5664C63.8318 6.42217 63.1302 5.78265 61.7611 5.78265C60.7172 5.78265 59.9779 5.98315 59.0949 6.31155L58.4103 4.20286C59.4714 3.72926 60.5187 3.4216 62.1547 3.4216C63.6504 3.4216 64.7286 3.8226 65.4131 4.51397C66.1319 5.23992 66.457 6.31501 66.457 7.62517V13.2806H63.8113V12.2263C63.1439 12.973 62.2266 13.4638 60.8952 13.4638C59.0777 13.4569 57.582 12.4026 57.582 10.4736ZM63.8661 9.83757V9.34669C63.3972 9.12891 62.7845 8.98372 62.1205 8.98372C60.9499 8.98372 60.2312 9.45731 60.2312 10.3284V10.3665C60.2312 11.1132 60.8438 11.5487 61.7269 11.5487C63.0036 11.5487 63.8661 10.8401 63.8661 9.83757Z'
                      fill='white'
                    ></path>
                    <path
                      d='M67.5977 11.9851L68.7682 10.1668C69.8121 10.9308 70.9108 11.3318 71.811 11.3318C72.605 11.3318 72.9644 11.0414 72.9644 10.6058V10.5712C72.9644 9.96974 72.0266 9.76924 70.9656 9.44429C69.6136 9.0433 68.0837 8.40723 68.0837 6.51632V6.48175C68.0837 4.4975 69.6684 3.3913 71.6125 3.3913C72.8378 3.3913 74.1692 3.80958 75.2131 4.51824L74.1692 6.42644C73.2143 5.86297 72.2594 5.51728 71.5577 5.51728C70.8903 5.51728 70.548 5.80766 70.548 6.19137V6.22594C70.548 6.77213 71.4653 7.02793 72.5126 7.39091C73.8646 7.84722 75.4288 8.50057 75.4288 10.2843V10.3189C75.4288 12.4829 73.8269 13.4646 71.7357 13.4646C70.3871 13.4577 68.8777 13.0049 67.5977 11.9851Z'
                      fill='white'
                    ></path>
                    <path
                      d='M76.4688 8.45529V8.41726C76.4688 5.63447 78.4299 3.34256 81.24 3.34256C84.4641 3.34256 85.9393 5.86954 85.9393 8.63504C85.9393 8.85283 85.9222 9.10864 85.9017 9.36099H79.1864C79.4568 10.6158 80.3193 11.2692 81.5446 11.2692C82.4619 11.2692 83.1293 10.9788 83.8857 10.2701L85.4533 11.6702C84.5531 12.7971 83.2559 13.4885 81.5104 13.4885C78.6113 13.4954 76.4688 11.4386 76.4688 8.45529ZM83.273 7.63946C83.1122 6.4019 82.39 5.56533 81.2365 5.56533C80.1036 5.56533 79.3643 6.38461 79.1487 7.63946H83.273Z'
                      fill='white'
                    ></path>
                    <path
                      d='M93.6492 0.580383H96.4592L91.6811 14H88.8711L93.6492 0.580383Z'
                      fill='white'
                    ></path>
                  </svg>
                </div>
                <h4> 제로베이스</h4>
                <p>프론트엔드 스쿨 13기</p>
              </div>
              <p className='date'>2023.03.01 ~ 2023.08.31</p>
              <div className='education-hover_btns'>
                <div>
                  <button>활동 사진 보기</button>
                  <button>수료증 보기</button>
                </div>
              </div>
            </li>
            <li>
              <div className='info'>
                <div className='logo'>
                  <img
                    src='https://academy.dream-coding.com/logo-long-white.svg'
                    alt=''
                  />
                </div>
                <h4> 드림코딩아카데미</h4>
                <p>Git 마스터 과정</p>
                <p>리액트 개념정리 · 클론코딩</p>
                <p>프론트엔드 필수 브라우저 101</p>
                <p>자바스크립트 마스터리 (ES6+)</p>
              </div>
              <p className='date'>2023.03.01 ~ 2023.08.31</p>
              <div className='education-hover_btns'>
                <div>
                  <button>활동 사진 보기</button>
                  <button>수료증 보기</button>
                </div>
              </div>
            </li>
            <li>
              <div className='info'>
                <div className='logo'>
                  <img src='https://nomadcoders.co/m.svg' alt='' />
                </div>
                <h4> 노마드코더</h4>
                <p>React JS 마스터클래스</p>
                <p>트위터 클론코딩</p>
              </div>
              <p className='date'>2023.03.01 ~ 2023.08.31</p>
              <div className='education-hover_btns'>
                <div>
                  <button>활동 사진 보기</button>
                  <button>수료증 보기</button>
                </div>
              </div>
            </li>
            <li>
              <div className='info'>
                <div className='logo'>
                  <img src='https://image.yes24.com/goods/92742567/XL' alt='' />
                </div>
                <div className='text'>
                  <h4>
                    이웅모 저자님과 함께하는 <br /> 북스터디
                  </h4>
                  <p className='title'>자바스크립트 북스터디</p>
                </div>
              </div>
              <p className='date'>2023.03.01 ~ 2023.08.31</p>
              <div className='education-hover_btns'>
                <div>
                  <button>활동 사진 보기</button>
                  <button>수료증 보기</button>
                </div>
              </div>
            </li>
          </ul>
        </article>
        <article className='about_skills'>
          <h3 className='common_h3'>My Skills</h3>
        </article>
        <article className='about_kit'>
          <h3 className='common_h3'>My dev Kit</h3>
          <div className='kit-hover_area'>
            <ul>
              <li className='item1'>1</li>
              <li className='item2'>2</li>
              <li className='item3'>3</li>
              <li className='item4'>4</li>
            </ul>
          </div>
        </article>
      </>
    </SubLayout>
  );
}
